package com.company;
/*
Написать метод, преобразует данную строку к формату Каждое Слово С Большой Буквы.
 */
public class UpperCaseWords {
    public static void main(String[] args) {
        System.out.println("Coming soon...");
    }
}
